_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 30, 16)        160       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 15, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 12, 13, 16)        2320      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 9)                 5193      
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 30        
=================================================================
Total params: 7,703
Trainable params: 7,703
Non-trainable params: 0
_________________________________________________________________
